import React, { useEffect, useRef, useState } from 'react';
import './CompetitionPage.css';
import volleyballTeam from '../../images/Pages/competition/volleyballTeam.jpg';
import badmintonTeam from '../../images/Pages/competition/badmintonTeam.jpg';
import { useDispatch } from 'react-redux';
import { changeLoader } from '../../redux/loader/loader-actions';
import Container from '../../components/Container/Container';
import ButtonDown from '../../components/ButtonDown/ButtonDown';
import Footer from '../../components/Footer/Footer';

export default function CompetitionPage() {
  const competitionMouse = useRef(null);
  const competition2efect = useRef(null);
  const competition4efect = useRef(null);
  const dispatch = useDispatch();
  const [openSector1, setOpenSector1] = useState(false);
  const [openSector2, setOpenSector2] = useState(false);
  const [openDetailed1, setOpenDetailed1] = useState(true);
  const [openDetailed2, setOpenDetailed2] = useState(true);
  const [openDetailed3, setOpenDetailed3] = useState(true);
  const [openDetailed4, setOpenDetailed4] = useState(true);
  const [openDetailed5, setOpenDetailed5] = useState(true);

  useEffect(() => {
    competitionMouse.current.addEventListener('mousemove', parallax);
    setTimeout(() => {
      dispatch(changeLoader(true));
    }, 1000);
    // eslint-disable-next-line react-hooks/exhaustive-deps
  }, []);

  function parallax(e) {
    const rect = e.currentTarget.getBoundingClientRect();
    const mouseX = e.clientX - rect.left;
    const mouseY = e.clientY - rect.top;
    const width = window.innerWidth;
    const height = window.innerHeight;
    const x = (width / 2 - mouseX) / 20;
    const y = (height / 2 - mouseY) / 20;
    competition2efect.current.style.transform = `translate3d(${x}px,${y}px,0px)`;
    competition4efect.current.style.transform = `translate3d(${x}px,${y}px,0px)`;
  }
  return (
    <div ref={competitionMouse}>
      <div className="competition">
        <Container>
          <div className="competition__container">
            <h1 className="competition__title">
              <span className="competition__text-1">спортивно</span>
              <span className="competition__text-2">масова</span>
              <span className="competition__text-3">робата</span>
            </h1>
          </div>
          <ButtonDown />
        </Container>
      </div>
      <div className="competition-2">
        <Container>
          <h2 className="competition__title-2">
            <span className="competition__text-1">волейбол</span>
          </h2>
          <div ref={competition2efect} className="box-img">
            <img
              className="competition__img"
              src={volleyballTeam}
              alt="volleyballTeam"
              height="420"
            />
          </div>
          <div className="competition__box-text">
            <p>
              Змагання проводяться з метою розвитку волейболу як масового виду
              спорту та підвищення ролі фізичної культури для студентської
              молоді.
            </p>
            <p>Головні завдання:</p>
            <ul className="List">
              <li>
                Популяризація волейболу і пропаганда здорового способу життя
                серед студентської молоді.
              </li>
              <li>
                Популяризація волейболу і пропаганда здорового способу життя
                серед студентської молоді.
              </li>
              <li>
                Залучення студентів до систематичних занять спортом –
                волейболом.
              </li>
              <li>Підвищення спортивної майстерності студентів.</li>
              <li>Виявлення кращих спортсменів для збірної команди КММФК.</li>
            </ul>
          </div>
          <div className="competition__box-about">
            <div className="competition__colum">
              <div className="competition__colum-box-title">
                <h4 className="competition__colum-title">
                  Першість ЗФПО "Київський міський медичний фаховий коледж" з
                  волейболу серед дівчат.
                </h4>
                <h5
                  className="competition__colum-title-h5"
                  onClick={() => setOpenDetailed1(!openDetailed1)}
                >
                  Загальні умови проведення змагань.
                </h5>
              </div>
              <p
                className={
                  openDetailed1
                    ? 'competition__colum-text'
                    : 'competition__colum-text competition__colum-text-show'
                }
              >
                Команди які беруть участь у першості розподіляються на 8 груп, в
                кожній групі по 4 команди відповідно рейтингу змагань минулого
                року. Кращі 8 команд потрапляють в різні групи таблиці за
                жеребкуванням і є лідерами даної групи. Наступні 8 команд також
                потрапляють в різні групи тим самим способом . Останні команди
                кожної групи це найсильніші команд 1 курсу( за оцінкою викладача
                фізичного виховання та підтвердженням головного судді змагань)
                які потрапляють до змагань за заявкою викладача фізичного
                виховання даної групи. Третіми командами кожної групи – є слабші
                команди 1 курсу, команди старших курсів які не брали участі в
                попередніх розіграшах та другі команди від груп відповідно
                заявок. Якщо команд які бажають взяти участь у змаганнях є
                більше ніж 8, тоді між ними проводяться відбіркові ігри (за
                вихід до групового етапу )на виліт. Пари формуються за допомогою
                жеребкування. Команди які перемогли потрапляють автоматично в
                групи. Якщо в групах залишаються вільні місця, тоді з
                переможених команд визначаються сильніші по кількості виграних
                партій, або набраних очках. Ігри в групах проводяться на малому
                полі за спрощеними правилами до 15 очок та 2-х виграшних партій
                за коловою системою; Ігри в 1/8, 1/4, в півфіналі та фіналі
                першості проводяться на великому полі за офіційними правилами з
                волейболу до 25 очок та 2-х виграшних партій на виліт. Команди
                які дійшли до 1/4 фіналу знову проходять жеребкування. Якщо в
                змаганнях бере участь дві команди від однієї групи, тоді
                студенти повинні грати лише в тій команді в якій вони заявлені.
                Об’єднати команду можна лише в тому випадку коли одна команда
                вибуває зі змагань, а інша продовжує боротьбу.
              </p>
            </div>
            <div className="competition__colum">
              <div className="competition__colum-box-title">
                <h4 className="competition__colum-title">
                  Кубок ЗФПО "Київський міський медичний фаховий коледж" з
                  волейболу серед дівчат.
                </h4>
                <h5
                  className="competition__colum-title-h5"
                  onClick={() => setOpenDetailed2(!openDetailed2)}
                >
                  Загальні умови проведення змагань.
                </h5>
              </div>
              <p
                className={
                  openDetailed2
                    ? 'competition__colum-text'
                    : 'competition__colum-text competition__colum-text-show'
                }
              >
                Всі команди які беруть участь у розіграші Кубка за допомогою
                жеребкування розподіляються в турнірній таблиці (додаток 1),
                відповідно рейтингу першості КММФК з волейболу (додаток 2).
                Кращі команди рейтингу потрапляють у різні підгрупи таблиці і є
                лідерами. Слабші команди за допомогою жеребкування складають
                пару сильнішим. Ігри 1/16 та 1/8, проводяться на малому полі за
                спрощеними правилами до 15 очок та 2-х виграшних партій на
                виліт; Ігри в 1/4, півфіналу та фіналу проводяться на великому
                полі за офіційними правилами з волейболу до 25 очок та 2-х
                виграшних партій, також на виліт. Якщо в змаганнях бере участь
                дві команди від однієї групи, тоді студенти повинні грати лише в
                тій команді у якій вони заявлені. Об’єднати команду можна лише в
                тому випадку коли одна команда вибуває зі змагань, а інша
                продовжує боротьбу.
              </p>
            </div>
            <div className="competition__colum">
              <div className="competition__colum-box-title">
                <h4 className="competition__colum-title">
                  ЛІГА 1 курсу ЗФПО "Київський міський медичний фаховий коледж"
                  з волейболу серед дівчат на звання: «Найсильніша волейбольна
                  команда КММФК"
                </h4>
                <h5
                  className="competition__colum-title-h5"
                  onClick={() => setOpenDetailed3(!openDetailed3)}
                >
                  Загальні умови проведення змагань.
                </h5>
              </div>
              <p
                className={
                  openDetailed3
                    ? 'competition__colum-text'
                    : 'competition__colum-text competition__colum-text-show'
                }
              >
                Всі команди які беруть участь у Лізі грають одна з одною за
                коловою системою, відповідно графіку ігор. Ліга проходить
                протягом 4-5 турів, залежно від кількості команд які подали
                заявку. Ігри проводяться на малому полі за спрощеними правилами
                до 15 очок та 2-х виграшних партій.
              </p>
            </div>
          </div>
          <div className="history-box">
            <div
              className="sector"
              onClick={() => setOpenSector2(!openSector2)}
            >
              <div className="spoller">
                <div className="data">2022-2023 навчальний рік</div>
                <div
                  className="icon"
                  style={{
                    transform: `${openSector2 ? 'rotate(45deg)' : 'rotate(0)'}`,
                  }}
                ></div>
              </div>
              <div className={openSector2 ? 'tabs tabs-active' : 'tabs'}>
                <p>
                  Загальні умови проведення змагань, Програма. Всі учасники, які
                  беруть участь у чемпіонаті, розподіляються на групи по 12
                  чоловік у кожній: - вищу лігу ( кращі студенти коледжу за
                  результатами осіннього чемпіонату); - першу лігу( студенти
                  середнього рівня гри); - другу лігу ( студенти початкового
                  рівня гри). Кожну середу та п’ятницю о 15.00 кращі спортсмени
                  - відповідно рейтингу змагань, за допомогою жеребкування,
                  вибирають собі партнера, з яким будуть грати ігри відповідного
                  туру за коловою системою проти інших суперників. Ігри
                  проводяться з одної партії, до 21 очка. Забороняється участь
                  чоловічих пар. Учасник, який не встигає на гру, повинен
                  попередити завчасно, для правильного проведення жеребкування.
                  Учасник, який не з’явився на гру отримує «-2 бала». Учасники,
                  які з’явилися пізніше 15.00 до змагань не допускаються.
                </p>
                <p>
                  Загальні умови проведення змагань, Програма. Всі учасники, які
                  беруть участь у чемпіонаті, розподіляються на групи по 12
                  чоловік у кожній: - вищу лігу ( кращі студенти коледжу за
                  результатами осіннього чемпіонату); - першу лігу( студенти
                  середнього рівня гри); - другу лігу ( студенти початкового
                  рівня гри). Кожну середу та п’ятницю о 15.00 кращі спортсмени
                  - відповідно рейтингу змагань, за допомогою жеребкування,
                  вибирають собі партнера, з яким будуть грати ігри відповідного
                  туру за коловою системою проти інших суперників. Ігри
                  проводяться з одної партії, до 21 очка. Забороняється участь
                  чоловічих пар. Учасник, який не встигає на гру, повинен
                  попередити завчасно, для правильного проведення жеребкування.
                  Учасник, який не з’явився на гру отримує «-2 бала». Учасники,
                  які з’явилися пізніше 15.00 до змагань не допускаються.
                </p>
              </div>
            </div>
            <div
              className="sector"
              onClick={() => setOpenSector1(!openSector1)}
            >
              <div className="spoller">
                <div className="data">до-2022 навчального року</div>
                <div
                  className="icon"
                  style={{
                    transform: `${openSector1 ? 'rotate(45deg)' : 'rotate(0)'}`,
                  }}
                ></div>
              </div>
              <div className={openSector1 ? 'tabs tabs-active' : 'tabs'}>
                <p>
                  Загальні умови проведення змагань, Програма. Всі учасники, які
                  беруть участь у чемпіонаті, розподіляються на групи по 12
                  чоловік у кожній: - вищу лігу ( кращі студенти коледжу за
                  результатами осіннього чемпіонату); - першу лігу( студенти
                  середнього рівня гри); - другу лігу ( студенти початкового
                  рівня гри). Кожну середу та п’ятницю о 15.00 кращі спортсмени
                  - відповідно рейтингу змагань, за допомогою жеребкування,
                  вибирають собі партнера, з яким будуть грати ігри відповідного
                  туру за коловою системою проти інших суперників. Ігри
                  проводяться з одної партії, до 21 очка. Забороняється участь
                  чоловічих пар. Учасник, який не встигає на гру, повинен
                  попередити завчасно, для правильного проведення жеребкування.
                  Учасник, який не з’явився на гру отримує «-2 бала». Учасники,
                  які з’явилися пізніше 15.00 до змагань не допускаються.
                </p>
                <p>
                  Загальні умови проведення змагань, Програма. Всі учасники, які
                  беруть участь у чемпіонаті, розподіляються на групи по 12
                  чоловік у кожній: - вищу лігу ( кращі студенти коледжу за
                  результатами осіннього чемпіонату); - першу лігу( студенти
                  середнього рівня гри); - другу лігу ( студенти початкового
                  рівня гри). Кожну середу та п’ятницю о 15.00 кращі спортсмени
                  - відповідно рейтингу змагань, за допомогою жеребкування,
                  вибирають собі партнера, з яким будуть грати ігри відповідного
                  туру за коловою системою проти інших суперників. Ігри
                  проводяться з одної партії, до 21 очка. Забороняється участь
                  чоловічих пар. Учасник, який не встигає на гру, повинен
                  попередити завчасно, для правильного проведення жеребкування.
                  Учасник, який не з’явився на гру отримує «-2 бала». Учасники,
                  які з’явилися пізніше 15.00 до змагань не допускаються.
                </p>
              </div>
            </div>
          </div>
        </Container>
      </div>
      <div className="competition-2">
        <Container>
          <h2 className="competition__title-2">
            <span className="competition__text-1">бадмінтон</span>
          </h2>
          <div ref={competition4efect} className="box-img">
            <img
              className="competition__img"
              src={badmintonTeam}
              alt="badmintonTeam"
              height="420"
            />
          </div>
          <div className="competition__box-text">
            <p>
              Змагання проводяться з метою розвитку бадмінтону, як масового виду
              спорту та ефективного засобу підвищення ролі фізичної культури в
              житті студентської молоді.
            </p>
            <p>Головні завдання:</p>
            <ul className="List">
              <li>
                Популяризація бадмінтону та пропаганда здорового способу життя
                серед студентської молоді.
              </li>
              <li>
                Залучення студентів до систематичних занять спортом –
                бадмінтоном.
              </li>
              <li>Підвищення спортивної майстерності студентів.</li>
              <li>Виявлення кращої команди ЗФПО КММФК.</li>
            </ul>
          </div>
          <div className="competition__box-about">
            <div className="competition__colum">
              <div className="competition__colum-box-title">
                <h4 className="competition__colum-title">
                  Чемпіонат ЗФПО "Київський міський медичний фаховий коледж" з
                  бадмінтону серед студентів та викладачів.
                </h4>
                <h5
                  className="competition__colum-title-h5"
                  onClick={() => setOpenDetailed4(!openDetailed4)}
                >
                  Загальні умови проведення змагань.
                </h5>
              </div>
              <p
                className={
                  openDetailed4
                    ? 'competition__colum-text'
                    : 'competition__colum-text competition__colum-text-show'
                }
              >
                Всі учасники, які беруть участь у чемпіонаті, розподіляються на
                групи по 12 чоловік у кожній: - вищу лігу ( кращі студенти
                коледжу за результатами осіннього чемпіонату); - першу лігу(
                студенти середнього рівня гри); - другу лігу ( студенти
                початкового рівня гри). Кожну середу та п’ятницю о 15.00 кращі
                спортсмени - відповідно рейтингу змагань, за допомогою
                жеребкування, вибирають собі партнера, з яким будуть грати ігри
                відповідного туру за коловою системою проти інших суперників.
                Ігри проводяться з одної партії, до 21 очка. Забороняється
                участь чоловічих пар. Учасник, який не встигає на гру, повинен
                попередити завчасно, для правильного проведення жеребкування.
                Учасник, який не з’явився на гру отримує «-2 бала». Учасники,
                які з’явилися пізніше 15.00 до змагань не допускаються.
              </p>
            </div>
            <div className="competition__colum">
              <div className="competition__colum-box-title">
                <h4 className="competition__colum-title">
                  Tурніру з бадмінтону «парна категорія дівчата» в програмі
                  спартакіади ЗФПО "Київський міський медичний фаховий коледж".
                </h4>
                <h5
                  className="competition__colum-title-h5"
                  onClick={() => setOpenDetailed5(!openDetailed5)}
                >
                  Загальні умови проведення змагань.
                </h5>
              </div>
              <p
                className={
                  openDetailed5
                    ? 'competition__colum-text'
                    : 'competition__colum-text competition__colum-text-show'
                }
              >
                <ul className="List">
                  <li>Змагання проводяться із загальнокомандним заліком:</li>
                  <li>Зустріч складається з 1 партії до 21 очка.</li>
                  <li>
                    Система проведення змагань визначається відповідно кількості
                    поданих заявок учасників.
                  </li>
                </ul>
              </p>
            </div>
          </div>
          <div className="history-box">
            <div
              className="sector"
              onClick={() => setOpenSector2(!openSector2)}
            >
              <div className="spoller">
                <div className="data">2022-2023 навчальний рік</div>
                <div
                  className="icon"
                  style={{
                    transform: `${openSector2 ? 'rotate(45deg)' : 'rotate(0)'}`,
                  }}
                ></div>
              </div>
              <div className={openSector2 ? 'tabs tabs-active' : 'tabs'}>
                <p>
                  Загальні умови проведення змагань, Програма. Всі учасники, які
                  беруть участь у чемпіонаті, розподіляються на групи по 12
                  чоловік у кожній: - вищу лігу ( кращі студенти коледжу за
                  результатами осіннього чемпіонату); - першу лігу( студенти
                  середнього рівня гри); - другу лігу ( студенти початкового
                  рівня гри). Кожну середу та п’ятницю о 15.00 кращі спортсмени
                  - відповідно рейтингу змагань, за допомогою жеребкування,
                  вибирають собі партнера, з яким будуть грати ігри відповідного
                  туру за коловою системою проти інших суперників. Ігри
                  проводяться з одної партії, до 21 очка. Забороняється участь
                  чоловічих пар. Учасник, який не встигає на гру, повинен
                  попередити завчасно, для правильного проведення жеребкування.
                  Учасник, який не з’явився на гру отримує «-2 бала». Учасники,
                  які з’явилися пізніше 15.00 до змагань не допускаються.
                </p>
                <p>
                  Загальні умови проведення змагань, Програма. Всі учасники, які
                  беруть участь у чемпіонаті, розподіляються на групи по 12
                  чоловік у кожній: - вищу лігу ( кращі студенти коледжу за
                  результатами осіннього чемпіонату); - першу лігу( студенти
                  середнього рівня гри); - другу лігу ( студенти початкового
                  рівня гри). Кожну середу та п’ятницю о 15.00 кращі спортсмени
                  - відповідно рейтингу змагань, за допомогою жеребкування,
                  вибирають собі партнера, з яким будуть грати ігри відповідного
                  туру за коловою системою проти інших суперників. Ігри
                  проводяться з одної партії, до 21 очка. Забороняється участь
                  чоловічих пар. Учасник, який не встигає на гру, повинен
                  попередити завчасно, для правильного проведення жеребкування.
                  Учасник, який не з’явився на гру отримує «-2 бала». Учасники,
                  які з’явилися пізніше 15.00 до змагань не допускаються.
                </p>
              </div>
            </div>
            <div
              className="sector"
              onClick={() => setOpenSector1(!openSector1)}
            >
              <div className="spoller">
                <div className="data">до-2022 навчального року</div>
                <div
                  className="icon"
                  style={{
                    transform: `${openSector1 ? 'rotate(45deg)' : 'rotate(0)'}`,
                  }}
                ></div>
              </div>
              <div className={openSector1 ? 'tabs tabs-active' : 'tabs'}>
                <p>
                  Загальні умови проведення змагань, Програма. Всі учасники, які
                  беруть участь у чемпіонаті, розподіляються на групи по 12
                  чоловік у кожній: - вищу лігу ( кращі студенти коледжу за
                  результатами осіннього чемпіонату); - першу лігу( студенти
                  середнього рівня гри); - другу лігу ( студенти початкового
                  рівня гри). Кожну середу та п’ятницю о 15.00 кращі спортсмени
                  - відповідно рейтингу змагань, за допомогою жеребкування,
                  вибирають собі партнера, з яким будуть грати ігри відповідного
                  туру за коловою системою проти інших суперників. Ігри
                  проводяться з одної партії, до 21 очка. Забороняється участь
                  чоловічих пар. Учасник, який не встигає на гру, повинен
                  попередити завчасно, для правильного проведення жеребкування.
                  Учасник, який не з’явився на гру отримує «-2 бала». Учасники,
                  які з’явилися пізніше 15.00 до змагань не допускаються.
                </p>
                <p>
                  Загальні умови проведення змагань, Програма. Всі учасники, які
                  беруть участь у чемпіонаті, розподіляються на групи по 12
                  чоловік у кожній: - вищу лігу ( кращі студенти коледжу за
                  результатами осіннього чемпіонату); - першу лігу( студенти
                  середнього рівня гри); - другу лігу ( студенти початкового
                  рівня гри). Кожну середу та п’ятницю о 15.00 кращі спортсмени
                  - відповідно рейтингу змагань, за допомогою жеребкування,
                  вибирають собі партнера, з яким будуть грати ігри відповідного
                  туру за коловою системою проти інших суперників. Ігри
                  проводяться з одної партії, до 21 очка. Забороняється участь
                  чоловічих пар. Учасник, який не встигає на гру, повинен
                  попередити завчасно, для правильного проведення жеребкування.
                  Учасник, який не з’явився на гру отримує «-2 бала». Учасники,
                  які з’явилися пізніше 15.00 до змагань не допускаються.
                </p>
              </div>
            </div>
          </div>
        </Container>
      </div>
      <Footer />
    </div>
  );
}
