import OnSer from '../../images/teachers/OnSer.png';
import KuLub from '../../images/teachers/KuLub.png';
import NaTam from '../../images/teachers/NaTam.png';
import NoLid from '../../images/teachers/NoLid.png';
import SoBik from '../../images/teachers/SoBik.png';
import EmSer from '../../images/teachers/EmSer.png';

export const teachers = [
  {
    name: 'Сонько Віктор Андрійович',
    info: [
      'Керівник фізичного виховання',
      'Викладач: вищої категорії, методист',
      'Стаж роботи в КММФК: 2010 року',
      'Освіта: вища (ПХДПІ ім. Сковороди.)',
    ],
    img: SoBik,
  },
  {
    name: 'Кузьменко Любов Василівна',
    info: [
      'Зав.циклом, Кандидат в майстри спорту',
      'Викладач: вищої категорії, методист',
      'Стаж роботи в КММФК: 2002 року',
      'Освіта: вища (НУФВІСУ)',
    ],
    img: KuLub,
  },
  {
    name: 'Онищенко Сергій Миколайович',
    info: [
      'Зав.кабінетом, майстер спорту',
      'Викладач: спеціаліст',
      'Стаж роботи в КММК: 2021 року',
      'Освіта: вища (НПУ ім. Дрангоманова)',
    ],
    img: OnSer,
  },
  {
    name: 'Ноур Лідія Іванівна',
    info: [
      'Майстер спорту',
      'Викладач: вищої категорії',
      'Стаж роботи в КММК: 1987 року',
      'Освіта: вища (КДІФК)',
    ],
    img: NoLid,
  },
  {
    name: 'Нагорна Тамара Миколаївна',
    info: [
      'Майстер спорту',
      'Викладач: вищої категорії',
      'Стаж роботи в КММК: 2002 року',
      'Освіта: вища (КДІФК)',
    ],
    img: NaTam,
  },
  {
    name: 'Ємельянов Сергій Генадійович',
    info: [
      'Майстер спорту',
      'Викладач: першої категорії',
      'Стаж роботи в КММК: 2016 року',
      'Освіта: вища (ЛДІФК)',
    ],
    img: EmSer,
  },
];
